#include "Collider.h"

#include "Model.h"

///=====================================================/// 
/// コンストラクタ
///=====================================================///
Collider::Collider() {

	//半径の設定
	radius_ = 1.0f;

	//衝突フラグをfalseで設定
	isCollision_ = false;

	//大きさの設定
	transform_->SetScale({ 1.1f,1.1f,1.1f });
}

///=====================================================/// 
/// 更新
///=====================================================///
void Collider::Update() {

	//3Dオブジェクトの更新
	Object3D::Update();
}

///=====================================================/// 
/// 描画
///=====================================================///
void Collider::Draw() {

	//3Dオブジェクトの描画
	Object3D::Draw();
}